<template>
  <div class="root d-flex">
    <div class="layout d-flex flex-row">
      <div class="main-home-block d-flex">
        <sidebar class="sidebarHome" />
        <main class="d-flex">
          <p class="p-4 text-light text-xl-center">
            Добро пожаловать на наш сайт, посвященный удивительной тайне
            Космоса! Шаг в бескрайнее пространство, где звезды, планеты и
            галактики раскрывают свои загадки. Узнайте больше о невероятных
            открытиях и достижениях человечества в изучении Вселенной. Мы
            предлагаем увлекательное путешествие, которое позволит вам заглянуть
            в далекие уголки Космоса и расширить свои горизонты. Наши страницы
            наполнены увлекательными фактами, захватывающими статьями и
            захватывающими изображениями, которые приоткроют завесу загадочного
            и неизведанного. Разделы нашего сайта охватывают широкий спектр тем:
            от истории исследования Космоса до фундаментальных научных открытий,
            от путешествий к другим планетам до поиска жизни во Вселенной. Наша
            команда экспертов стремится предоставить вам самую свежую информацию
            из мира астрономии и космических исследований. Мы погружаемся в
            глубины науки и делаем ее доступной каждому, представляя сложные
            концепции в простой и увлекательной форме. Мы также приглашаем вас
            принять участие в нашем активном сообществе, где вы сможете
            поделиться своими идеями, задать вопросы ученым и обсудить самые
            актуальные темы в области космических исследований. Приготовьтесь к
            незабываемому путешествию по бескрайней вселенной! Откройте для себя
            удивительные факты, вдохновляющие истории и уникальные видения о
            Космосе. Погрузитесь в нашу страницу и откройте для себя бесконечные
            возможности, которые предлагает нам Вселенная. Добро пожаловать в
            мир Космоса!
          </p>
        </main>
      </div>
    </div>
  </div>
</template>

<script setup>
import Sidebar from "../views/Sidebar/Sidebar.vue";
</script>

<style scoped lang="scss">
.layout {
  height: 100%;
  width: 100%;
  .sidebarHome {
    width: 15rem;
  }
  .main-home-block {
    main {
      // background: url("../assets/HomeImages/HomeBg.png");
      background-color: rgba(8, 8, 8, 0.897);
      width: 100%;
      height: 100%;
    }
  }
}
</style>
